referenceMTO/newMTO/app/0/Ua
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      Ua;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
/*
    inlet
    {
        type            codedFixedValue;
        value           uniform (0 0 0);
        redirectType    parabolicVelocity;
    }
*/
    inlet
    {
        type            fixedValue;
        value           uniform (0 -0.05 0);
    }
    outlet
    {
        type            adjointOutletVelocityPower;
        value           uniform (0 0 0);
    }

    Wall
    {
        type            noSlip;
    }
    right
    {
        type            symmetry;
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
