referenceMTO/newMTO/app/0/Ub
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      Ub;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    outlet
    {
        type            adjointOutletVelocityHeat;
        value           uniform (0 0 0);
    }

    Wall
    {
        type            noSlip;
    }
    right
    {
        type            symmetry;
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
/*
    right
    {
       type             groovyBC;
       valueExpression  "vector(0,0,0)";
       gradientExpression "vector(0,0,0)";
       fractionExpression "1";
       value           uniform (0 0 0);  
    }
*/
